# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой,
# а некоторые – гербом. Определите минимальное число монеток,
# которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же
# стороной. Выведите минимальное количество монет, которые нужно перевернуть

# 5 -> 1 0 1 1 0


# a = int(input())
# c = 0
# for i in range(a):
#     b = int(input())
#     if b == 1:
#         c += 1
# print(c if c < a / 2 else a-c)


# Задача 12:  Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать.
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.

# 4 4 -> 2 2
# 5 6 -> 2 3


# a = int(input())

# b = int(input())

# for i in range(a + b):

#     if i == (a * i - b)**0.5:
#     #  возведение в степень

#      print( i,)


# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
# 10 -> 1 2 4 8

# n = int(input())
# m = 1
# while m < n:
#   if(m < n):
#    if (m * 2 > n):
#     break
# else:
#  m = m * 2
# print(m)


